Revit 2027 API
UIDocument.ShowElements(ElementSet) Method
Shows the elements by zoom to fit.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ShowElements(
	ElementSet elements
)
Public Sub ShowElements (
	elements As ElementSet
)
public:
void ShowElements(
	ElementSet^ elements
)
member ShowElements :
        elements : ElementSet -> unit
Parameters
elements ElementSet
The set of elements that will be shown.
Exceptions
Exception | Condition
ArgumentNullException | Elements is null.
ArgumentException | Member of elements is null.
Remarks
Places all the elements on the screen by moving the view.
See Also
Reference
UIDocument Class
ShowElements Overload
Autodesk.Revit.UI Namespace